
#Python...
#   [Big Data, AI]
    # 분석용 데이터 구축
        # - 직접 : 출 / 퇴근 시간에 노약자석을 체크
        # - 누군가가 모아놓은 데이터를 구매
        # - (위의 두 방법을 못하는 경우) 웹 데이터(XML, JSON, HTML) 가져오기
    
    # 분석 -(사람이 하면)-> BigData분석 프로젝트
    # 분석 -(AI가 하면)-> AI 프로젝트
    # 결과를 한눈에 알아보기 쉽게... -> 시각화(표, 그래프, ...)
    
#   -> Python은 빅데이터 분석용 도구? 툴? => X => 프로그래밍 언어 !!!
#################################################################
# Java vs Python
#################################################################

# Java : 규칙의 언어
    #필수) 
    #   JDK 설치 
    #옵션) 
    #   Eclipse 설치 
    #   Project는 중요한 개념!
    #   컴파일러 방식
    #   OOP의 코드를 재사용하기 위해서 : 1 file = 1 class        
            
# Python : 자유의 언어 
    #필수) 
    #   python 설치 (ver 3.8.3) - 개발툴 IDLE이 딸려 옴
    #   Add Python 3.8 Path 체크 - CMD환경에서 명령어 쓰기 편하게
    #옵션)
    #   eclipse에서 pydev추가
    #   (IntelliJ,PyCharm, ...)
    #   Project는 그냥 파일 모아놓는 폴더
    #   인터프리터 방식
    #   OOP의 코드 재사용 > 관심 X : 1 file != 1 class
##################################################################
    
    
# Big Data : 
#   1) python : 분석용 데이터 구축
#   2) Hadoop : 분석 << 리눅스
#   3) R, python : 시각화

#   데이터 구축...
#   1)python으로 xml/json 파싱 => DB에 넣는...
#   2)DB에 있는 데이터를 분석용 파일로...(.csv파일, .txt파일, ...)
##################################################################



    