// 멤버 변수 : 속성 (소개할 때 언급할만한 것)
// 지역 변수 : 그 행동을 하는 동안만 의미가 있는 것
// 파라미터 : 그 행동을 하는데 필요한 재료
// 리턴 : 그 행동의 결과물

// Up! Down! ( 1 ~ 100 )
public class OMain1 {
	public static void main(String[] args) {
		Referee r = new Referee();
		Friend f = new Friend();
		r.start(f);
	}
}

// 심판 / 친구 / 나
// 주도적으로 끌고 갈 인물
// 등장인물이 다 등장해야...!
//		상황 설정은 제각각
//		심판과 친구는 나와있고 -> 심판이 나를 불러내는 상황
//		심판 => 친구 답요구 : 종이에 답을 적어서 제출
//		심판 => 나 답요구 : 말로 대답을 할 것!
//		판정
//		맞출때까지 진행 => 몇번째 시도만에 정답을 맞췄는지






